# Location Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Group..::..Location Property
Group Class See Also
---
This property is used to find the physical location of a group within project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override Location Location { get; }
```

Visual Basic
---
```text
Public Overrides ReadOnly Property Location As Location
	Get
```

Visual C++
---
```text
public:
virtual property Location^ Location {
	Location^ get () override;
}
```

# Remarks
The Location property returns an object that can be used to find the location of an object within the project. Groups return a point location object.
# See Also
Group Class
Autodesk.Revit.DB Namespace